45-JWT-token/server/app/controllers/application_controller.rb

      def current_user
        # byebug
        if decoded_token
        # byebug
          user_id = decoded_token["user_id"]

          User.find(user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]