19-Rails-Association-One-Many/app/controllers/dragons_controller.rb

SELECT "dragons".* FROM "dragons"
---
  def index
    @dragons = Dragon.all

INSERT INTO "dragons" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["age", 2000], ["created_at", "2019-07-22 15:10:26.964449"], ["updated_at", "2019-07-22 15:10:26.964449"]]
---
  def create
    # byebug
    @dragon = Dragon.create(dragons_params)

UPDATE "dragons" SET "name" = ?, "age" = ?, "updated_at" = ? WHERE "dragons"."id" = ?  [["name", "testttttt"], ["age", 2500], ["updated_at", "2019-07-22 15:37:29.760603"], ["id", 7]]
---
  def update
    # @dragon = Dragon.find(params[:id])
    @dragon.update(dragons_params)

DELETE FROM "dragons" WHERE "dragons"."id" = ?  [["id", 2]]
---
  def destroy
    # byebug
    # @dragon = Dragon.find(params[:id])
    @dragon.destroy

SELECT  "dragons".* FROM "dragons" WHERE "dragons"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_dragon
    @dragon = Dragon.find(params[:id])