23-Rails-session-cookies/app/controllers/responses_controller.rb

    def define_question
        @question = Question.order("RANDOM()").limit(1)[0]
---
SELECT  "questions".* FROM "questions" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 1]]

    def create
            if session[:number_correct] == nil
                session[:number_correct] = 0
            end
            response = Response.create(response_params)
---
INSERT INTO "responses" ("question_id", "answer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["question_id", 2], ["answer_id", 6], ["created_at", "2019-07-30 15:29:57.393527"], ["updated_at", "2019-07-30 15:29:57.393527"]]