17-Intro-rails/app/controllers/dogs_controller.rb

  def show
    # byebug
    @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]