21-Rails-Validations/app/controllers/owners_controller.rb

    def new
        @owner = Owner.new
        @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons" WHERE 1=0

    def create
        # byebug
        @owner = Owner.new(owners_params)

        if @owner.valid?
            @owner.save
---
INSERT INTO "owners" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "lkrglkh wglwrlgf"], ["created_at", "2019-07-24 16:03:51.927998"], ["updated_at", "2019-07-24 16:03:51.927998"]]

    def edit
        @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

    def update
        @owner.update(owners_params)
---
UPDATE "owners" SET "name" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["name", "Vidhiii"], ["updated_at", "2019-07-23 16:32:50.886478"], ["id", 3]]

    def destroy
        @owner.destroy
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 4]]

    def current_owner
        @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]