20-Rails-Association-Many-Many/app/controllers/dragons_controller.rb

  def index
    @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

  def new
    @dragon = Dragon.new
    @owners = Owner.all
---
SELECT "owners".* FROM "owners"

  def create
    # byebug
    @dragon = Dragon.create(dragons_params)
---
INSERT INTO "dragons" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Charles"], ["age", 2000], ["created_at", "2019-07-23 18:52:55.454613"], ["updated_at", "2019-07-23 18:52:55.454613"]]

  def edit
    # @dragon = Dragon.find(params[:id])
    @owners = Owner.all
---
SELECT "owners".* FROM "owners"

  def update
    # @dragon = Dragon.find(params[:id])
    @dragon.update(dragons_params)
---
UPDATE "dragons" SET "owner_id" = ?, "updated_at" = ? WHERE "dragons"."id" = ?  [["owner_id", 2], ["updated_at", "2019-07-23 16:00:25.184864"], ["id", 5]]

  def destroy
    # byebug
    # @dragon = Dragon.find(params[:id])
    @dragon.destroy
---
DELETE FROM "dragons" WHERE "dragons"."id" = ?  [["id", 2]]

  def current_dragon
    @dragon = Dragon.find(params[:id])
---
SELECT  "dragons".* FROM "dragons" WHERE "dragons"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]