20-Rails-Association-Many-Many/app/controllers/owners_controller.rb

    def new
        @owner = Owner.new
        @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

    def create
        # byebug
        @owner = Owner.create(owners_params)
---
INSERT INTO "owners" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Syed"], ["created_at", "2019-07-23 19:05:42.444295"], ["updated_at", "2019-07-23 19:05:42.444295"]]

    def edit
        @dragons = Dragon.all
---
SELECT "dragons".* FROM "dragons"

    def update
        @owner.update(owners_params)
---
UPDATE "owners" SET "name" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["name", "Vidhiii"], ["updated_at", "2019-07-23 16:32:50.886478"], ["id", 3]]

    def destroy
        @owner.destroy
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 3]]

    def current_owner
        @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]