22-Rails-review/app/views/students/edit.html.erb

SELECT "instructors".* FROM "instructors"
---
<%= f.number_field :age %>
<%= f.collection_select :instructor_id, Instructor.all, :id, :name %>