22-Rails-review/app/views/students/new.html.erb

<%= f.number_field :age %>
<%= f.collection_select :instructor_id, Instructor.all, :id, :name %>
---
SELECT "instructors".* FROM "instructors"