22-Rails-review/app/controllers/instructors_controller.rb

    def create
        @instructor = Instructor.new(i_params)

        if @instructor.valid?
            @instructor.save
---
INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Josh"], ["created_at", "2019-07-25 21:49:15.945730"], ["updated_at", "2019-07-25 21:49:15.945730"]]

    def update
        @instructor.update(i_params)
---
UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Vidhi s"], ["updated_at", "2019-07-25 21:58:10.854447"], ["id", 1]]

    def destroy
        @instructor.destroy
---
DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 4]]