22-Rails-review/app/controllers/students_controller.rb

    def create
        @student = Student.new(s_params)

        if @student.valid?
            @student.save
---
INSERT INTO "students" ("name", "major", "age", "instructor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Dummy"], ["major", "SE"], ["age", 20], ["instructor_id", 1], ["created_at", "2019-07-25 22:24:50.088714"], ["updated_at", "2019-07-25 22:24:50.088714"]]

    def update
        @student.assign_attributes(s_params)

        if @student.valid?
            @student.update(s_params)
---
UPDATE "students" SET "age" = ?, "instructor_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 22], ["instructor_id", 2], ["updated_at", "2019-07-25 22:29:13.976646"], ["id", 7]]