24-Rails-Auth/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.valid?
            @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jordan"], ["password_digest", "$2a$12$jON9vJqCRqCU4kAC2RkR4ue8LueHjT/PuFWdfwOv0AB0D2zP0VdPG"], ["created_at", "2019-07-30 20:43:17.979696"], ["updated_at", "2019-07-30 20:43:17.979696"]]